app/controllers/posts_controller.rb

  def create
    @post = Post.new(get_params)
    @post.user_id = current_user.id
    puts "==>>>>>"
    puts @post.image
    puts "==>>>>>"
    if params[:back]
      render :new
    else
      if @post.save
---
INSERT INTO "posts" ("content", "urlImage", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "imo vania"], ["urlImage", nil], ["user_id", 6], ["created_at", "2021-10-24 16:30:53.245795"], ["updated_at", "2021-10-24 16:30:53.245795"]]

  def update
    if @post.update(get_params)
---
UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "LOGO_IMDAD_TECH.png"], ["updated_at", "2021-10-24 17:02:42.376864"], ["id", 3]]